farid132097/Atmega328P_Optimized_Libraries/timebase.c
  #ifdef TIMEBASE_DOWNCOUNTER
  for(uint8_t i=0; i < TIMEBASE_DOWNCOUNTER; i++){
    Timebase->DownCounter[i].Status.StatusByte = 0; 
    Timebase->DownCounter[i].EndValue = 0;
    Timebase->DownCounter[i].Value = 0;
    Timebase->DownCounter[i].PeriodValue = 0;
  }
  #endif
  
  #ifdef TIMEBASE_DOWNCOUNTER_SUBSECONDS
  for(uint8_t i=0; i < TIMEBASE_DOWNCOUNTER_SUBSECONDS; i++){
    Timebase->DownCounterSS[i].Status.StatusByte = 0; 
    Timebase->DownCounterSS[i].EndValueSec = 0;
	Timebase->DownCounterSS[i].EndValueSubSec = 0;
    Timebase->DownCounterSS[i].Value = 0;
    Timebase->DownCounterSS[i].PeriodValue = 0;
  }
  #endif
  
  #ifdef TIMEBASE_LP_DOWNCOUNTER
  for(uint8_t i=0; i < TIMEBASE_LP_DOWNCOUNTER; i++){
    Timebase->LPDownCounter[i].Status.StatusByte = 0; 
    Timebase->LPDownCounter[i].EndValue = 0;
    Timebase->LPDownCounter[i].Value = 0;
    Timebase->LPDownCounter[i].PeriodValue = 0;
  }
  #endif
  
}


void Timebase_Timer_Config(uint16_t UpdateRateHz){
  uint8_t  clock_div_index = 0;
  uint16_t clock_div_factor[5] = {1, 8, 64, 256, 1024};
  int32_t  temp, curr_freq;

  temp = F_CPU;
  temp /= UpdateRateHz;
	
  clock_div_index = 0;
  curr_freq = temp;
	
  while( curr_freq > 0xFF ){
	curr_freq  = temp;
	curr_freq /= clock_div_factor[clock_div_index];
	clock_div_index++;
	if(clock_div_index == 5){
	  break;
	}
  }
	
  clock_div_index -= 1;
	
  TCCR0A = 0x00;
  TCCR0B = 0x00;
  TIMSK0 = 0x00;
  TIFR0  = 0x00;
  OCR0A  = 0x00;
  OCR0B  = 0x00;
  TCNT0  = 0x00;
  OCR0A  = 0x00;
	
  if(clock_div_index == 0){
	TCCR0B = (1<<CS00);
  }else if(clock_div_index == 1){
	TCCR0B = (1<<CS01);
  }else if(clock_div_index == 2){
	TCCR0B = (1<<CS00)|(1<<CS01);
  }else if(clock_div_index == 3){
	TCCR0B = (1<<CS02);
  }else if(clock_div_index == 4){
	TCCR0B = (1<<CS00)|(1<<CS02);
  }
	
  Timebase->Time.OVFUpdateValue = (0xFF-curr_freq);
  TCNT0  = Timebase->Time.OVFUpdateValue;
  TIMSK0 = (1<<TOIE0);
  sei();

  Timebase->Config.UpdateRate = UpdateRateHz;
}


#ifdef TIMEBASE_LP_TIMER_ENABLE

void Timebase_LPTimer_Config(uint16_t UpdateRateHz){
    uint8_t  Prescaler_val;
	
    if(UpdateRateHz == 1){
      Prescaler_val = 0x06;
    }else if(UpdateRateHz ==2 ){
      Prescaler_val = 0x05;
    }else if(UpdateRateHz == 4){
      Prescaler_val = 0x04;
    }else if(UpdateRateHz == 8){
      Prescaler_val = 0x03;
    }else if(UpdateRateHz == 16){
      Prescaler_val = 0x02;
    }else if(UpdateRateHz == 32){
      Prescaler_val = 0x01;
    }else if(UpdateRateHz == 64){
      Prescaler_val = 0x00;
    }else{
      Prescaler_val = 0x00;
    }
    cli();
    MCUSR  &=~(1<<WDRF);
    WDTCSR |= (1<<WDIF);
    WDTCSR |= (1<<WDCE)|(1<<WDE);
    WDTCSR  = (1<<WDIE)|Prescaler_val;
    sei();
	Timebase->Config.LPUpdateRate = UpdateRateHz;
}

#endif

/**********************************Basic Functions End********************************/









/********************************Atomic Functions Start*******************************/


void Timebase_Atomic_Operation_Start(void){
  cli();
}


void Timebase_Atomic_Operation_End(void){
  sei();
}


/*********************************Atomic Functions End********************************/









/***********************************Timer ISR Start**********************************/

ISR(TIMER0_OVF_vect){
  TCNT0  = Timebase->Time.OVFUpdateValue;
  Timebase_ISR_Executables();
}

/************************************Timer ISR End***********************************/









/**********************************LPTimer ISR Start*********************************/

#ifdef TIMEBASE_LP_TIMER_ENABLE

ISR(WDT_vect){
  WDTCSR |= (1<<WDIE);
  Timebase_LP_ISR_Executables();
}

#endif

/***********************************LPTimer ISR End**********************************/









/*********************************Token Functions Start*******************************/

#ifdef TIMEBASE_TOKEN_FUNCTIONS
uint8_t Timebase_Token_Executing(void){
  return Timebase->ActiveTokens;
}


void Timebase_Token_Add(void){ 
  if( Timebase_Token_Executing() < 63){
    Timebase->ActiveTokens += 1;
  }
}


void Timebase_Token_Remove(void){
  if( Timebase_Token_Executing() > 0){
    Timebase->ActiveTokens -= 1;
  }
}


void Timebase_Token_Remove_All(void){
  Timebase->ActiveTokens = 0;
}
#endif

/*********************************Token Functions End********************************/









/*****************************Base Timer Functions Start*****************************/

uint16_t Timebase_Timer_Get_SubSecondsShadow(void){
  return Timebase->Time.SubSecondsShadow;
}


int32_t Timebase_Timer_Get_SecondsShadow(void){
  return Timebase->Time.SecondsShadow;
}


uint16_t Timebase_Timer_Get_SubSeconds(void){
  return Timebase->Time.SubSeconds;
}


int32_t Timebase_Timer_Get_Seconds(void){
  return Timebase->Time.Seconds;
}


void Timebase_Timer_Set_SubSeconds(uint16_t value){
  Timebase->Time.SubSeconds = value;
}


void Timebase_Timer_Set_Seconds(int32_t value){
  Timebase->Time.Seconds = value;
}


void Timebase_Timer_Sync_With_Shadow_Variables(void){
  if(Timebase->Time.VariablesSync == TIMEBASE_FALSE){
    
	#ifdef TIMEBASE_COUNT_ATOMIC_OPERATION
    Timebase_Atomic_Operation_Start();
    Timebase->Time.SubSeconds = Timebase->Time.SubSecondsShadow;
    Timebase->Time.Seconds    = Timebase->Time.SecondsShadow;
    Timebase_Atomic_Operation_End();
    #else
    #warning Shadow Variables Atomic Sync Turned Off
    Timebase->Time.SubSeconds = Timebase->Time.SubSecondsShadow;
    Timebase->Time.Seconds    = Timebase->Time.SecondsShadow;
    #endif
	
	Timebase->Time.VariablesSync = TIMEBASE_TRUE;
  }
}


void Timebase_Timer_Delay_SubSeconds(uint16_t value){
  
  int32_t smpl_val = 0, smpl_ss = 0, smpl_s = 0;
  int32_t curr_val = 0, curr_ss = 0, curr_s = 0; 
  
  Timebase_Atomic_Operation_Start();
  smpl_ss  = Timebase_Timer_Get_SubSecondsShadow();
  smpl_s   = Timebase_Timer_Get_SecondsShadow();
  Timebase_Atomic_Operation_End();
  
  smpl_val  = smpl_s;
  smpl_val *= Timebase->Config.UpdateRate;
  smpl_val += smpl_ss;
  smpl_val += value;
  
  while(curr_val<smpl_val){
    Timebase_Atomic_Operation_Start();
    curr_ss   = Timebase_Timer_Get_SubSecondsShadow();
	curr_s    = Timebase_Timer_Get_SecondsShadow();
	Timebase_Atomic_Operation_End();
    curr_val  = curr_s;
	curr_val *= Timebase->Config.UpdateRate;
	curr_val += curr_ss;
  }
  
